{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "GameEventSystemSettings",
			"Children": [
				{
					"Source":
					{
						"Text": "Configure logging settings for the Game Event System plugin"
					},
					"Translation":
					{
						"Text": "Configure logging settings for the Game Event System plugin"
					},
					"Key": "SectionDescription"
				},
				{
					"Source":
					{
						"Text": "Game Event System"
					},
					"Translation":
					{
						"Text": "Game Event System"
					},
					"Key": "SectionText"
				}
			]
		},
		{
			"Namespace": "K2Node",
			"Children": [
				{
					"Source":
					{
						"Text": "Add Data Type Pin"
					},
					"Translation":
					{
						"Text": "Add Data Type Pin"
					},
					"Key": "AddDataTypePin"
				},
				{
					"Source":
					{
						"Text": "Add Listener"
					},
					"Translation":
					{
						"Text": "Add Listener"
					},
					"Key": "AddListener_Title"
				},
				{
					"Source":
					{
						"Text": "Add a listener to the game event system. 【{0}】"
					},
					"Translation":
					{
						"Text": "Add a listener to the game event system. 【{0}】"
					},
					"Key": "AddListener_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Adds a Data Type pin to specify the delegate parameter type"
					},
					"Translation":
					{
						"Text": "Adds a Data Type pin to specify the delegate parameter type"
					},
					"Key": "AddDataTypePinTooltip"
				},
				{
					"Source":
					{
						"Text": "Binding type: Function name or Delegate"
					},
					"Translation":
					{
						"Text": "Binding type: Function name or Delegate"
					},
					"Key": "AddListener_BindType_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Check if the specified event exists in the game event system. [{0}]"
					},
					"Translation":
					{
						"Text": "Check if the specified event exists in the game event system. [{0}]"
					},
					"Key": "HasEvent_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Delegate node is invalid, please recreate! @@"
					},
					"Translation":
					{
						"Text": "Delegate node is invalid, please recreate! @@"
					},
					"Key": "AddListener_DelegateInvalid"
				},
				{
					"Source":
					{
						"Text": "Delegate to bind"
					},
					"Translation":
					{
						"Text": "Delegate to bind"
					},
					"Key": "AddListener_Delegate_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event Exists"
					},
					"Translation":
					{
						"Text": "Event Exists"
					},
					"Key": "HasEvent_ReturnValue"
				},
				{
					"Source":
					{
						"Text": "Event ID type: String or GameplayTag"
					},
					"Translation":
					{
						"Text": "Event ID type: String or GameplayTag"
					},
					"Key": "GetEventListenerCount_EventIdType_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event ID type: String or GameplayTag"
					},
					"Translation":
					{
						"Text": "Event ID type: String or GameplayTag"
					},
					"Key": "AddListener_EventIdType_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to check"
					},
					"Translation":
					{
						"Text": "Event name to check"
					},
					"Key": "GetEventListenerCount_EventTag_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to check"
					},
					"Translation":
					{
						"Text": "Event name to check"
					},
					"Key": "GetEventListenerCount_EventString_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to register"
					},
					"Translation":
					{
						"Text": "Event name to register"
					},
					"Key": "AddListener_EventString_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to register"
					},
					"Translation":
					{
						"Text": "Event name to register"
					},
					"Key": "AddListener_EventTag_Tooltip"
				},
				{
					"Source":
					{
						"Text": "GameEventSystem"
					},
					"Translation":
					{
						"Text": "GameEventSystem"
					},
					"Key": "GameEventCategory"
				},
				{
					"Source":
					{
						"Text": "Get the number of listeners for the specified event. [{0}]"
					},
					"Translation":
					{
						"Text": "Get the number of listeners for the specified event. [{0}]"
					},
					"Key": "GetEventListenerCount_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Has Even"
					},
					"Translation":
					{
						"Text": "Has Even"
					},
					"Key": "HasEvent_Title"
				},
				{
					"Source":
					{
						"Text": "Invalid pins in @@"
					},
					"Translation":
					{
						"Text": "Invalid pins in @@"
					},
					"Key": "InvalidPins"
				},
				{
					"Source":
					{
						"Text": "Listener Count"
					},
					"Translation":
					{
						"Text": "Listener Count"
					},
					"Key": "GetEventListenerCount_ReturnValue"
				},
				{
					"Source":
					{
						"Text": "Number of listeners for this event"
					},
					"Translation":
					{
						"Text": "Number of listeners for this event"
					},
					"Key": "GetEventListenerCount_ReturnValue_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Receiver object to remove all listeners from"
					},
					"Translation":
					{
						"Text": "Receiver object to remove all listeners from"
					},
					"Key": "RemoveAllListeners_Receiver_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Remove All Listeners For Receiver"
					},
					"Translation":
					{
						"Text": "Remove All Listeners For Receiver"
					},
					"Key": "RemoveAllListenersForReceiver_Title"
				},
				{
					"Source":
					{
						"Text": "Remove Last Data Type Pin"
					},
					"Translation":
					{
						"Text": "Remove Last Data Type Pin"
					},
					"Key": "RemoveDataTypePin"
				},
				{
					"Source":
					{
						"Text": "Remove Listener"
					},
					"Translation":
					{
						"Text": "Remove Listener"
					},
					"Key": "RemoveListener_Title"
				},
				{
					"Source":
					{
						"Text": "Remove all event listeners registered by the specified receiver object. [{0}]"
					},
					"Translation":
					{
						"Text": "Remove all event listeners registered by the specified receiver object. [{0}]"
					},
					"Key": "RemoveAllListenersForReceiver_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Remove listener from game event system. 【{0}】"
					},
					"Translation":
					{
						"Text": "Remove listener from game event system. 【{0}】"
					},
					"Key": "RemoveListener_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Removes the last Data Type pin"
					},
					"Translation":
					{
						"Text": "Removes the last Data Type pin"
					},
					"Key": "RemoveDataTypePinTooltip"
				},
				{
					"Source":
					{
						"Text": "Send Event"
					},
					"Translation":
					{
						"Text": "Send Event"
					},
					"Key": "SendEvent_Title"
				},
				{
					"Source":
					{
						"Text": "Sends an event to the game event system. 【{0}】"
					},
					"Translation":
					{
						"Text": "Sends an event to the game event system. 【{0}】"
					},
					"Key": "SendEvent_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "GetEventListenerCount_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "HasEvent_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "RemoveAllListenersForReceiver_Receiver"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "AddListener_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "RemoveListener_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "SendEvent_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "Target"
					},
					"Key": "UnpinEvent_Self"
				},
				{
					"Source":
					{
						"Text": "Target object for listening"
					},
					"Translation":
					{
						"Text": "Target object for listening"
					},
					"Key": "AddListener_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target object for removing event"
					},
					"Translation":
					{
						"Text": "Target object for removing event"
					},
					"Key": "RemoveListener_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target object for sending event"
					},
					"Translation":
					{
						"Text": "Target object for sending event"
					},
					"Key": "SendEvent_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target object's function name"
					},
					"Translation":
					{
						"Text": "Target object's function name"
					},
					"Key": "AddListener_FunctionName_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Unpin Event"
					},
					"Translation":
					{
						"Text": "Unpin Event"
					},
					"Key": "UnpinEvent_Title"
				},
				{
					"Source":
					{
						"Text": "Unpin the specified event and clear pinned data. [{0}]"
					},
					"Translation":
					{
						"Text": "Unpin the specified event and clear pinned data. [{0}]"
					},
					"Key": "UnpinEvent_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Whether the event exists"
					},
					"Translation":
					{
						"Text": "Whether the event exists"
					},
					"Key": "HasEvent_ReturnValue_Tooltip"
				},
				{
					"Source":
					{
						"Text": "World context object"
					},
					"Translation":
					{
						"Text": "World context object"
					},
					"Key": "HasEvent_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "World context object"
					},
					"Translation":
					{
						"Text": "World context object"
					},
					"Key": "UnpinEvent_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "World context object"
					},
					"Translation":
					{
						"Text": "World context object"
					},
					"Key": "GetEventListenerCount_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "event game system"
					},
					"Translation":
					{
						"Text": "event game system"
					},
					"Key": "GameEventBase_Keywords"
				},
				{
					"Source":
					{
						"Text": "remove all listeners receiver cleanup clear unbind unsubscribe event game system"
					},
					"Translation":
					{
						"Text": "remove all listeners receiver cleanup clear unbind unsubscribe event game system"
					},
					"Key": "RemoveAllListeners_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} addevent add listener addlistener bind subscribe register hook attach"
					},
					"Translation":
					{
						"Text": "{0} addevent add listener addlistener bind subscribe register hook attach"
					},
					"Key": "AddListener_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} get event listener count geteventlistenercount number amount size num"
					},
					"Translation":
					{
						"Text": "{0} get event listener count geteventlistenercount number amount size num"
					},
					"Key": "GetEventListenerCount_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} has event hasevent check exist contains valid"
					},
					"Translation":
					{
						"Text": "{0} has event hasevent check exist contains valid"
					},
					"Key": "HasEvent_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} removeevent remove listener removelistener unbind unsubscribe unregister detach"
					},
					"Translation":
					{
						"Text": "{0} removeevent remove listener removelistener unbind unsubscribe unregister detach"
					},
					"Key": "RemoveListener_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} send event sendevent trigger fire emit dispatch broadcast"
					},
					"Translation":
					{
						"Text": "{0} send event sendevent trigger fire emit dispatch broadcast"
					},
					"Key": "SendEvent_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} unpin event unpinevent clear reset release unlock"
					},
					"Translation":
					{
						"Text": "{0} unpin event unpinevent clear reset release unlock"
					},
					"Key": "UnpinEvent_Keywords"
				}
			]
		},
		{
			"Namespace": "UK2Node_GetEventListenerCount",
			"Children": [
				{
					"Source":
					{
						"Text": "GetEventListenerCount function not found"
					},
					"Translation":
					{
						"Text": "GetEventListenerCount function not found"
					},
					"Key": "GetEventListenerCountFunctionNotFound"
				}
			]
		},
		{
			"Namespace": "UK2Node_HasEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "HasEvent function not found"
					},
					"Translation":
					{
						"Text": "HasEvent function not found"
					},
					"Key": "HasEventFunctionNotFound"
				}
			]
		},
		{
			"Namespace": "UK2Node_RemoveAllListenersForReceiver",
			"Children": [
				{
					"Source":
					{
						"Text": "RemoveAllListenersForReceiver function not found"
					},
					"Translation":
					{
						"Text": "RemoveAllListenersForReceiver function not found"
					},
					"Key": "RemoveAllListenersForReceiverFunctionNotFound"
				}
			]
		},
		{
			"Namespace": "UK2Node_SendEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "Invalid parameters! @@"
					},
					"Translation":
					{
						"Text": "Invalid parameters! @@"
					},
					"Key": "ParamDataValid"
				},
				{
					"Source":
					{
						"Text": "Invalid pins in @@"
					},
					"Translation":
					{
						"Text": "Invalid pins in @@"
					},
					"Key": "InvalidPins"
				},
				{
					"Source":
					{
						"Text": "Type mismatch, please refresh the node! @@"
					},
					"Translation":
					{
						"Text": "Type mismatch, please refresh the node! @@"
					},
					"Key": "ParamDataMatch"
				}
			]
		},
		{
			"Namespace": "UK2Node_UnpinEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "UnpinEvent function not found"
					},
					"Translation":
					{
						"Text": "UnpinEvent function not found"
					},
					"Key": "UnpinEventFunctionNotFound"
				}
			]
		}
	]
}